final/app/views/home/home.html.erb

  function clear_list() {
      document.getElementById("lstAgency").options.length = 0;
---
SELECT `agency`.* FROM `agency` WHERE (1)